# ClassificationEntries Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClassificationEntries Class
Members See Also
---
A collection of ClassificationEntry objects that make up the classification table.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class ClassificationEntries : KeyBasedTreeEntries
```

Visual Basic
---
```text
Public Class ClassificationEntries _
	Inherits KeyBasedTreeEntries
```

Visual C++
---
```text
public ref class ClassificationEntries : public KeyBasedTreeEntries
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..KeyBasedTreeEntries Autodesk.Revit.DB..::..ClassificationEntries
# See Also
ClassificationEntries Members
Autodesk.Revit.DB Namespace